app/Http/Controllers/CategoriesController.php

select * from `topics` where `category_id` = '1' order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `topics` where `category_id` = '1'
---
    public function show(Category $category, Request $request)
    {
        $topics = Topic::withOrder($request->order)
                        ->where('category_id', $category->id)
                        ->paginate(20);