app/Http/Controllers/TopicsController.php

	public function index(Request $request)
    {
        $topics = Topic::withOrder($request->order)->paginate(20);
---
select * from `topics` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `topics`